app/Controllers/CartController.php

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function addToCart($productId)
    {
        $productModel = new ProductModel();
        $cartModel = new CartModel();

        // Ürünü al
        $product = $productModel->find($productId);