app/Controllers/CheckoutController.php

    public function indexxx()
    {
        // Sepet verisini al
        $cartModel = new CartModel();
        $cartItems = $cartModel->findAll();

        // Toplam tutarı hesapla
        $totalAmount = 0;
        foreach ($cartItems as $item) {
            $productModel = new \App\Models\ProductModel();
            $product = $productModel->find($item['product_id']);
---
SELECT *
FROM `cart`
SELECT *
FROM `products`
WHERE `products`.`id` = '3'

    public function submit()
    {
        // Formdan gelen verileri al
        $data = $this->request->getPost();

        // OrderModel'i başlat
        $orderModel = new OrderModel();

        // Siparişi veritabanına ekle
        $orderModel->insert([
            'fullname' => $data['fullname'],
            'email' => $data['email'],
            'address' => $data['address'],
            'payment_method' => $data['payment_method'],
            'notes' => $data['notes'],
        ]);
---
INSERT INTO `orders` (`fullname`, `email`, `address`, `payment_method`, `notes`, `created_at`, `updated_at`) VALUES ('hjvnb', 'yakupcalbaz.2008@gmail.com', 'jkbjbjbjb', 'credit_card', '', '2025-01-02 19:45:34', '2025-01-02 19:45:34')