app/Models/CartModel.php

    public function addProductToCart($product)
    {
        $builder = $this->db->table('cart');
        // Sepette bu ürün var mı kontrol et
        $existingCartItem = $this->where('product_id', $product['id'])->first();

        if ($existingCartItem) {
            // Eğer ürün varsa miktarı güncelle
            $this->update($existingCartItem['id'], ['adet' => $existingCartItem['adet'] + 1]);
---
SELECT *
FROM `cart`
WHERE `product_id` = '1'
 LIMIT 1
UPDATE `cart` SET `adet` = 44
WHERE `cart`.`id` IN ('7')

    public function getCartDetails()
{
    $db = \Config\Database::connect();
    $builder = $db->table('cart');
    $builder->select('cart.id as cart_id, cart.adet, products.id as product_id, products.ad, products.marka, products.fiyat, products.resim');
    $builder->join('products', 'cart.product_id = products.id');
    $query = $builder->get();
---
SELECT *
FROM `cart`

    public function deleteItem($cart_id)
    {
        // Sepet tablosundan ürünü sil
        return $this->delete($cart_id);
---
DELETE FROM `cart`
WHERE `id` IN ('29')